app/Controllers/Admin/Auth.php

SELECT *
FROM `admin`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function attemptLogin()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('pass');

        $admin = $this->adminModel->where('email', $email)->first();