app/Models/CandidatesModel.php

SELECT `admin`.*
FROM `admin`
---
    public function get_data()
    {
        // echo "test";
        $builder = $this->db->table('admin');
        $builder->select('admin.*');


        $query = $builder->get();