app/Models/CatModel.php

SELECT `category`.*
FROM `category`
---
    public function getallData()
    {
        $builder = $this->db->table('category');
        $builder->select('category.*');


        $query = $builder->get();

SELECT `category`.*
FROM `category`
WHERE `category`.`id` = '17'
---
    public function getCatDataid($id)
    {
        $builder = $this->db->table('category');
        $builder->select('category.*');

        $builder->where('category.id', $id);
        $query = $builder->get();