app/Models/RoleModel.php

SELECT `role`.*
FROM `role`
---
    public function getallRoleData()
    {
        $builder = $this->db->table('role');
        $builder->select('role.*');


        $query = $builder->get();

SELECT `role`.*
FROM `role`
WHERE `role`.`name` = 'DATA MINER'
---
    public function getRoleDatabyrole($role)
    {
        $builder = $this->db->table('role');
        $builder->select('role.*');

        $builder->where('role.name', $role);
        $query = $builder->get();